gen_datasets/generate_data_3d/flow_over_array_of_cylinders/isothermal/laminar/sim_orig/system/extrudeMeshDict_outlet
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeMeshDict;
}

constructFrom patch;
sourceCase ".";
sourcePatches    (outlet);            // Name of the patch to extrude from
extrudeType      patchNormal;
exposedPatchName outlet;
direction (1 0 0);

flipNormals false;

extrudeModel linearDirection;

expansionRatio 1.041;
firstLayerThickness 0.005;
nLayers 60;


linearDirectionCoeffs
{
    direction (1 0 0);
    thickness 1.5;
}

mergeFaces false;
mergeTol 0;
