gen_datasets/generate_data_3d/flow_over_array_of_cylinders/isothermal/laminar/sim_orig/system/extrudeMeshDict_outlet_other
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeMeshDict;
}


constructFrom   mesh;

sourceCase      ".";

sourcePatches   (outlet);

flipNormals     false;

nLayers         25;

expansionRatio  1.09;

extrudeModel    linearNormal;

linearNormalCoeffs
{
    thickness       1.5;
}

mergeFaces      false;
