gen_datasets/generate_data_3d/flow_over_array_of_cylinders/isothermal/laminar/sim_orig/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-6;
        relTol           0.01;
        smoother         GaussSeidel;
    }

    pFinal
    {
        solver           GAMG;
        tolerance        1e-6;
        smoother         GaussSeidel;
    }

    U
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-6;
        nSweeps          1;
    }

    UFinal
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        nSweeps          1;
    }

}

PISO
{
    nNonOrthogonalCorrectors 1;
    nCorrectors 2;
}

relaxationFactors
{
}

cache
{
    grad(U);
}

// ************************************************************************* //
